var punjabiMonthsGeorgian = ["ਜਨਵਰੀ", "ਫ਼ਰਵਰੀ", "ਮਾਰਚ", "ਅਪ੍ਰੈਲ", "ਮਈ", "ਜੂਨ", "ਜੁਲਾਈ", "ਅਗਸਤ", "ਸਤੰਬਰ", "ਅਕਤੂਬਰ", "ਨਵੰਬਰ", "ਦਸੰਬਰ"]
var sampleText = 'ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਦਾ ਜਨਮ ੧੪ ਅਪ੍ਰੈਲ ੧੪੬੯ ਨੂੰ ਲਾਹੌਰ, ਪਾਕਿਸਤਾਨ ਨੇੜੇ ਰਾਇ ਭੋਇ ਦੀ ਤਲਵੰਡੀ, ਜਿਸਨੂੰ ਹੁਣ ਨਨਕਾਣਾ ਸਾਹਿਬ ਆਖਿਆ ਜਾਂਦਾ ਹੈ, ਵਿਖੇ ਹੋਇਆ ਜਿਸਨੂੰ ਹੁਣ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਦੇ ਪ੍ਰਕਾਸ਼ ਦਿਹਾੜੇ (ਗੁਰਪੁਰਬ) ਵਜੋਂ ਮਨਾਇਆ ਜਾਂਦਾ ਹੈ। ਇਸ ਸਥਾਨ ਤੇ ਹੁਣ ਗੁਰਦੁਆਰਾ ਜਨਮ-ਅਸਥਾਨ ਸੁਸ਼ੋਭਤ ਹੈ। ਇਹਨਾਂ ਦੇ ਪਿਤਾ, ਕਲਿਆਣ ਚੰਦ ਦਾਸ ਬੇਦੀ ਜਾਂ ਮਹਿਤਾ ਕਾਲੂ ਪਿੰਡ ਤਲਵੰਡੀ ਦੇ ਫ਼ਸਲ-ਮਾਮਲੇ ਦੇ ਪਟਵਾਰੀ ਸਨ ਅਤੇ ਉਸ ਇਲਾਕੇ ਦੇ ਇੱਕ ਮੁਸਲਮਾਨ ਜਿਮੀਂਦਾਰ ਰਾਇ ਬੁਲਾਰ ਹੇਠ ਨੌਕਰੀ ਕਰਦੇ ਸਨ। ਇਹਨਾਂ ਦੀ ਮਾਤਾ ਦਾ ਨਾਂ ਤ੍ਰਿਪਤਾ ਸੀ। ਇਹਨਾਂ ਦੀ ਵੱਡੀ ਭੈਣ ਦਾ ਨਾਂ ਬੇਬੇ ਨਾਨਕੀ ਸੀ ਜੋ ਇਹਨਾਂ ਦੀ ਪਹਿਲੀ ਸਿੱਖ ਬਣੀ। ਉੱਥੇ ਉਹ ੧੬ ਸਾਲ ਦੀ ਉਮਰ ਵਿੱਚ ਮੋਦੀਖਾਨੇ ਵਿੱਚ ਹੀ ਕੰਮ ਕਰਨ ਲੱਗ ਪਏ। ਪੁਰਾਤਨ ਜਨਮ-ਸਾਖੀਆਂ ਮੁਤਾਬਕ ਇਹ ਸਮਾਂ ਗੁਰੂ ਨਾਨਕ ਲਈ ਇੱਕ ਰਚਨਾਤਮਕ ਸਮਾਂ ਸੀ ਅਤੇ ਇਸ ਦੌਰਾਨ ਹੀ ਇਹਨਾਂ ਦੀ ਅਕਾਲ ਪੁਰਖ ਨੂੰ ਮਿਲਣ ਦੀ ਤਾਂਘ ਵਧੀ ਪਹਿਲੀ ਉਦਾਸੀ ਪੂਰਬ ਦੀ[ਸੋਧੋ] ਇਨ੍ਹਾਂ ਉਦਾਸੀਆਂ ਵਿੱਚੋਂ ਪਹਿਲੀ ਉਦਾਸੀ ਬਹੁਤ ਲੰਮੇਰੀ ਸੀ। ਪ੍ਰੋ. ਸਾਹਿਬ ਗੁਰਮਤਿ ਪ੍ਰਕਾਸ਼ ੧੨ ਨਵੰਬਰ ੨੦੦੭ ਸਿੰਘ ਜੀ ਅਨੁਸਾਰ ਭਾਦਰੋਂ ਸੰਮਤ ੧੫੬੪ ਤੋਂ ੧੫੭੨ (੮ ਸਾਲ) ਸੰਨ ੧੫੦੭ ਤੋਂ ੧੫੧੫ ਈ. ਤਕ ਦੀ ਇਹ ਯਾਤਰਾ ਸੀ। ਇਸ ਯਾਤਰਾ ਦੌਰਾਨ ਆਪ ਜੀ ਨੇ ਛੇ-ਸੱਤ ਹਜ਼ਾਰ ਮੀਲ ਦਾ ਸਫ਼ਰ ਕੀਤਾ। ਇਸ ਉਦਾਸੀ ਵਿੱਚ ਆਪ ਜੀ ਨੇ ਪ੍ਰਸਿੱਧ ਹਿੰਦੂ ਤੀਰਥਾਂ ਹਰਿਦੁਆਰ, ਗੋਰਖ ਮਤਾ, ਅਯੁੱਧਿਆ, ਪ੍ਰਯਾਗ, ਬਨਾਰਸ, ਗਯਾ, ਜਗਨਨਾਥਪੁਰੀ, ਮਦੁਰਾਈ, ਰਾਮੇਸ਼੍ਵਰਮ, ਸੋਮਨਾਥ, ਦਵਾਰਕਾ, ਪੁਸ਼ਕਰ, ਮਥਰਾ, ਬਿੰਦਰਾਬਨ ਅਤੇ ਕੁਰੂਕਸ਼ੇਤਰ ਆਦਿ ਤੋਂ ਇਲਾਵਾ ਸਿੰਗਲਾ ਦੀਪ, ਸਿੱਕਮ, ਆਸਾਮ, ਬੰਗਾਲ, ਉੜੀਸਾ, ਦਰਾਵੜ ਦੇਸ਼ ਬੰਬਈ, ਔਰੰਗਾਬਾਦ, ਉਜੈਨ, ਕੱਛ, ਅਜਮੇਰ ਆਦਿ ਸਥਾਨਾਂ ਦੀ ਯਾਤਰਾ ਕੀਤੀ। ਇਸ ਉਦਾਸੀ ਦੌਰਾਨ ਹੀ ਸਤਿਗੁਰੂ ਜੀ ਨੇ ਆਪਣੇ ਅਧਿਆਤਮਕ ਅਨੁਭਵਾਂ ਨੂੰ ਇੱਕ ਸੁਨਿਸ਼ਚਿਤ ਤੇ ਵਿਧੀਵਤ ਜੀਵਨਦਰਸ਼ਨ ਦਾ ਰੂਪ ਦਿੱਤਾ ਅਤੇ ਇਸ ਦੇ ਪ੍ਰਚਾਰ ਲਈ ਕੇਂਦਰ ਸਥਾਪਤ ਕਰਨ ਦੀ ਯੋਜਨਾ ਬਣਾਈ। ਇਸ ਉਦਾਸੀ ਤੋਂ ਵਾਪਸ ਆ ਕੇ ਆਪ ਜੀ ਆਪਣੇ ਕੁਝ ਕੁ ਪ੍ਰਮੁੱਖ ਸਿੱਖ ਸ਼ਰਧਾਲੂਆਂ ਦੀ ਸਹਾਇਤਾ ਨਾਲ ਗੁਰਦਾਸਪੁਰ ਜ਼ਿਲ੍ਹੇ ਵਿੱਚ ਰਾਵੀ ਦੇ ਕੰਢੇ ’ਤੇ ਇਕ ਨਵਾਂ ਪਿੰਡ ਕਰਤਾਰਪੁਰ ਵਸਾਇਆ। ਜਦੋਂ ਇਥੇ ਇੱਕ ਛੋਟੀ ਜਿਹੀ ਧਰਮਸ਼ਾਲ ਬਣ ਗਈ ਤਾਂ ਆਪ ਜੀ ਦੇ ਮਾਤਾ-ਪਿਤਾ ਵੀ ਇਥੇ ਹੀ ਆ ਗਏ। ਭਾਈ ਮਰਦਾਨਾ ਜੀ ਦਾ ਪਰਵਾਰ ਵੀ ਇਥੇ ਹੀ ਆ ਵੱਸਿਆ। ਕੁਝ ਚਿਰ ਸਤਿਗੁਰੂ ਜੀ ਨਗਰ ਵਸਾਉਣ ਦੇ ਆਹਰ ਵਿੱਚ ਰੁੱਝੇ ਰਹੇ ਪਰੰਤੂ ਛੇਤੀ ਹੀ ਦੂਜੀ ਉਦਾਸੀ ਲਈ ਚੱਲ ਪਏ। ਦੂਜੀ ਉਦਾਸੀ ਉੱਤਰ ਦੀ[ਸੋਧੋ] ਦੂਜੀ ਉਦਾਸੀ ਦੋ-ਤਿੰਨ ਕੁ ਸਾਲਾਂ ਦੀ ਸੀ। ਪ੍ਰੋ. ਸਾਹਿਬ ਸਿੰਘ ਅਨੁਸਾਰ ਇਹ ਉਦਾਸੀ ਸੰਨ ੧੫੧੭ ਤੋਂ ੧੫੧੮ ਤਕ ਦੀ ਸੀ। ਇਸ ਉਦਾਸੀ ਦੌਰਾਨ ਗੁਰਦੇਵ ਨੇ ਜੰਮੂ ਤੇ ਕਸ਼ਮੀਰ ਦੀ ਯਾਤਰਾ ਕੀਤੀ। ਆਪ ਗਿਆਨ ਕੋਟ ਅਤੇ ਜੰਮੂ ਤੋਂ ਹੁੰਦੇ ਹੋਏ ਪਹਿਲਾਂ ਵੈਸ਼ਨੋ ਦੇਵੀ ਗਏ, ਫਿਰ ਮਟਨ ਵਿੱਚ ਅਮਰਨਾਥ ਤੇ ਉਸ ਤੋਂ ਵੀ ਪਰ੍ਹੇ ਬਰਫ਼ਾਂ ਲੱਦੀ ਪਰਬਤ ਮਾਲਾ ਉਂਤੇ, ਜਿਥੇ ਕੁਝ ਸਿੱਧਾਂ ਨਾਲ ਆਪ ਜੀ ਦਾ ਸੰਵਾਦ ਹੋਇਆ। ਭਾਈ ਗੁਰਦਾਸ ਜੀ ਦਾ ਕਥਨ ਹੈ: -ਫਿਰਿ ਜਾਇ ਚੜ੍ਹਿਆ ਸੁਮੇਰ ਪਰਿ ਸਿਧਿ ਮੰਡਲੀ ਦ੍ਰਿਸਟਿ ਆਈ। (ਵਾਰ ੧;੨੮) -ਸਬਦਿ ਜਿਤੀ ਸਿਧਿ ਮੰਡਲੀ...। (ਵਾਰ 1;31) ਤੀਜੀ ਉਦਾਸੀ ਪੱਛਮ ਦੀ[ਸੋਧੋ] ਤੀਜੀ ਉਦਾਸੀ (ਸੰਨ ੧੫੧੮ ਤੋਂ ੧੫੨੧) ਤਕ ਹੈ, ਆਪ ਜੀ ਕਰਤਾਰਪੁਰ ਤੋਂ ਪੱਛਮ (ਮੱਧ ਪੂਰਬ) ਦੇ ਦੇਸ਼ਾਂ ਦੀ ਯਾਤਰਾ ਲਈ ਚੱਲੇ। ਭਾਈ ਗੁਰਦਾਸ ਜੀ ਦੇ ਕਥਨ ਅਨੁਸਾਰ: ਬਾਬਾ ਫਿਰਿ ਮੱਕੇ ਗਇਆ ਨੀਲ ਬਸਤ੍ਰ ਧਾਰੇ ਬਨਵਾਰੀ। (ਵਾਰ 1;32) ਓਪਰੀਆਂ ਧਰਤੀਆਂ ਓਪਰੇ ਲੋਕ ਪਰ ਸਤਿਗੁਰੂ ਜੀ ਨੂੰ ਤਾਂ ਕੁਝ ਵੀ ਓਪਰਾ ਨਹੀਂ ਸੀ ਲੱਗਦਾ। ਸਾਰੇ ਹੀ ਆਪਣੇ ਸਨ। ਇਸ ਵਾਰ ਆਪ ਜੀ ਕਰਤਾਰਪੁਰ ਤੋਂ ਗੁਰਮਤਿ ਪ੍ਰਕਾਸ਼ ੧੩ ਨਵੰਬਰ ੨੦੦੭ ਤੁਰੇ ਤਾਂ ਕਸੂਰ, ਪਾਕਪਟਨ, ਤੁਲੰਭਾ, ਮੁਲਤਾਨ, ਬਹਾਵਲਪੁਰ, ਸ਼ੱਖਰ ਆਦਿ ਕਈ ਥਾਵਾਂ ਤੋਂ ਹੁੰਦੇ ਹੋਏ ਮੁਸਲਿਮ ਹਾਜ਼ੀਆਂ ਦੇ ਕਾਫ਼ਿਲੇ ਵਿੱਚ ਸ਼ਾਮਿਲ ਹੋ ਕੇ ਮਕਰਾਨ ਦੇ ਇਲਾਕੇ ਵਿੱਚ ਪੁੱਜੇ। ਫਿਰ ਮੱਕੇ ਗਏ। ਮੱਕੇ ਹਾਜ਼ੀਆਂ ਨਾਲ ਗੁਰੂ ਜੀ ਦਾ ਵਿਚਾਰ-ਵਟਾਂਦਰਾ ਹੋਇਆ। ਰੁਕਨਦੀਨ ਨਾਲ ਬਹਿਸ ਹੋਈ। ਉਸ ਨੂੰ ਆਪਣੀ ਖੜਾਂਵ ਨਿਸ਼ਾਨੀ ਦਿੱਤੀ। ਫਿਰ ਮਦੀਨੇ ਗਏ, ਫਿਰ ਬਸਰੇ ਤੇ ਬਸਰੇ ਤੋਂ ਕਰਬਲਾ, ਫਿਰ ਬਗ਼ਦਾਦ। ਇਸ ਦਾ ਵਰਨਣ ਭਾਈ ਗੁਰਦਾਸ ਜੀ ਨੇ ਕੀਤਾ ਹੈ: ਫਿਰਿ ਬਾਬਾ ਗਇਆ ਬਗਦਾਦਿ ਨੋ ਬਾਹਰਿ ਜਾਇ ਕੀਆ ਅਸਥਾਨਾ। ਇਕੁ ਬਾਬਾ ਅਕਾਲ ਰੂਪੁ ਦੂਜਾ ਰਬਾਬੀ ਮਰਦਾਨਾ। (ਵਾਰ ੧;੩੫) ਰਾਗ ਨੂੰ ਹਰਾਮ ਸਮਝੇ ਜਾਣ ਵਾਲੇ ਸ਼ਹਿਰ ਵਿੱਚ ਕੀਰਤਨ, ਸੱਤ ਜ਼ਿਮੀਂ, ਅਸਮਾਨ ਮੰਨਣ ਵਾਲਿਆਂ ਨੂੰ ‘ਪਾਤਾਲਾ ਪਾਤਾਲ, ਲਖ ਆਗਾਸਾ ਆਗਾਸ’ ਦੱਸਦੇ ਹੋਏ ਫਿਰ ਬਗ਼ਦਾਦ ਤੋਂ ਇਸਫਰਾਨ, ਤਹਿਰਾਨ, ਮਸਤੱਕ ਬੁਖ਼ਾਰਾ ਤੇ ਸਮਰਕੰਦ ਹੁੰਦੇ ਹੋਏ ਕਾਬੁਲ ਤੇ ਜਲਾਲਾਬਾਦ ਦੇ ਰਸਤੇ ਰਾਵਲਪਿੰਡੀ ਦੇ ਲਾਗੇ ਹਸਨ ਅਬਦਾਲ ਪੁੱਜੇ। ਫਿਰ ਐਮਨਾਬਾਦ ਤੋਂ ਕਰਤਾਰਪੁਰ। ਇਸ ਉਦਾਸੀ ਦੌਰਾਨ ਸ੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਨੇ ਮੁਸਲਿਮ ਵਿਸ਼ਵਾਸਾਂ, ਰਹੁਰੀਤਾਂ ਤੇ ਧਰਮ-ਗ੍ਰੰਥਾਂ ਦਾ ਡੂੰਘਾ ਅਧਿਐਨ ਕੀਤਾ। ਐਮਨਾਬਾਦ ਬਾਬਰ ਦਾ ਹਮਲਾ ਹੋਇਆ, ਜਿਸ ਦਾ ਵਰਣਨ ਆਪ ਜੀ ਨੇ ਆਪਣੀ ਬਾਣੀ ਵਿੱਚ ਕੀਤਾ। ਕਰਤਾਰਪੁਰ ਨਿਵਾਸ[ਸੋਧੋ] ਆਪਣੇ ਜੀਵਨ ਦੇ ਅੰਤਿਮ ਅੱਠ-ਦਸ ਵਰ੍ਹੇ ਆਪ ਜੀ ਨੇ ਕਰਤਾਰਪੁਰ ਵਿਖੇ ਨਿਵਾਸ ਕੀਤਾ। ਜਿਥੇ ਆਪ ਜੀ ਨਿਤਨੇਮ, ਕਥਾ-ਕੀਰਤਨ ਤੇ ਭਜਨ-ਬੰਦਗੀ ਕਰਦੇ ਅਤੇ ਹਰ ਕਿਸੇ ਨੂੰ ਪ੍ਰਭੂ ਹੁਕਮ ਅਨੁਸਾਰ ਜੀਵਨ ਬਿਤਾਉਣ ਤੇ ਸਤਿਨਾਮ ਦਾ ਅਭਿਆਸ ਕਰਨ ਦੀ ਸਿਖਿਆ ਦੇਂਦੇ। ਭਾਈ ਮਰਦਾਨਾ ਜੀ ਨੇ ਆਪਣੇ ਅੰਤਿਮ ਸਵਾਸ ਆਪ ਜੀ ਦੀ ਗੋਦ ਵਿੱਚ ਲਏ। ਭਾਈ ਗੁਰਦਾਸ ਜੀ ਕਰਤਾਰਪੁਰ ਦੀ ਧਰਮਸ਼ਾਲਾ ਦਾ ਵਰਣਨ ਕਰਦੇ ਫ਼ੁਰਮਾਉਂਦੇ ਹਨ: ਗਿਆਨੁ ਗੋਸਟਿ ਚਰਚਾ ਸਦਾ ਅਨਹਦਿ ਸਬਦਿ ਉਠੇ ਧਨੁਕਾਰਾ। (ਵਾਰ 1;38) ਇਥੇ ਹੀ ਆਪ ਜੀ ਦਾ ਦੀਦਾਰ ਕਰਨ ਭਾਈ ਲਹਿਣਾ ਜੀ ਆਏ। ਦੀਦਾਰ ਐਸਾ ਹੋਇਆ ਕਿ ਜੋਤੀ ਜੋਤਿ ਰਲੀ। ਦੋਵੇਂ ਇੱਕ ਜੋਤ ਹੋ ਗਏ। ਭਾਈ ਲਹਿਣਾ ਜੀ ਸ੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਦਾ ਅੰਗ ਬਣ ਕੇ ਸ੍ਰੀ ਗੁਰੂ ਅੰਗਦ ਦੇਵ ਜੀ ਹੋ ਨਿਬੜੇ। 7 ਸਤੰਬਰ, ਸੰਨ 1539 ਨੂੰ ਸਤਿਗੁਰੂ ਸ੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਆਪਣਾ ਜੋਤਿ ਰੂਪੀ ਨੂਰ ਭਾਈ ਲਹਿਣਾ ਜੀ (ਸ੍ਰੀ ਗੁਰੂ ਅੰਗਦ ਦੇਵ ਜੀ) ਵਿੱਚ ਟਿਕਾ ਕੇ ਅਕਾਲ ਸਤਿ ਵਿੱਚ ਸਮਾ ਗਏ: ਸੂਰਜ ਕਿਰਣਿ ਮਿਲੇ ਜਲ ਕਾ ਜਲੁ ਹੂਆ ਰਾਮ॥ ਜੋਤੀ ਜੋਤਿ ਰਲੀ ਸੰਪੂਰਨੁ ਥੀਆ ਰਾਮ॥ (ਪੰਨਾ 846) ਡਾ.ਪਰਮਜੀਤ ਸਿੰਘ ਦੇ ਧੰਨਵਾਦ ਸਹਿਤ ਗੁਰਮਤ ਪ੍ਰਕਾਸ਼ (ਨਵੰਬਰ ੨੦੦੭ )ਵਿਚੌਂ'
// General RegExp
// [ਕ-ਲਅ-ਔਾ-ੌ੦-੯]+

// date regEx
// [੦-੯]+[ਾ-੍ਅ-ਔਕ-ਹ\s੍ੰ-ੳੱਂ]+[੦-੯]{4}

//Simple Function to found Any Date written in a Punjabi Text
function extractDateFromText(text) {
	return text.match(/[੦-੯0-9]+[ਾ-੍ਅ-ਔਕ-ਹ\s੍ੰ-ੳੱਂ]+[੦-੯0-9]{4}/g)
}

function getMiddleTextBetweenDate(dateString) {
	return dateString.match(/[ਾ-੍ਅ-ਔ੍ੰ-ੳੱਂਕ-ਹ.]+/g)
}

function processDateRangeAndExtractFromAndTo(dateRangeString) {
	var _from = dateRangeString.match(/[੦-੯]{1,4}\s/).join('')
	var _to = dateRangeString.match(/\s[੦-੯]{1,4}/).join('')
	return {
		from:_from,
		to:_to
	}
}
function processDatesFound(resArr) {
	for(var i=0;i<resArr.length;i++) {
		var middleText = getMiddleTextBetweenDate(resArr[i])
		if(middleText.length == 1) {
			var _middleText = middleText.join('')
			if(punjabiMonthsGeorgian.indexOf(_middleText) != -1) {
				console.log('month found', _middleText, ' Date is : ', resArr[i]);
			} else {
				console.log('date range found', resArr[i]);
				console.log(processDateRangeAndExtractFromAndTo(resArr[i]))
			}
		} else {
			console.log('length greater than one')
		}
	}
}

processDatesFound(extractDateFromText(sampleText));
